export const Events = {
  1: [
    {
      fr: "جشن نوروز",
      isHoliday: true,
    },
  ],
  2: [
    {
      fr: "جشن نوروز",
      isHoliday: true,
    },
  ],
  3: [
    {
      fr: "جشن نوروز",
      isHoliday: true,
    },
  ],
  4: [
    {
      fr: "جشن نوروز",
      isHoliday: true,
    },
  ],
  6: [
    {
      fr: "زادروز اشوزرتشت",
      isZHoliday: true,
    },
  ],
  7: [
    {
      fr: "زیارت پیر هریشت",
    },
  ],
  8: [
    {
      fr: "زیارت پیر هریشت",
    },
  ],
  9: [
    {
      fr: "زیارت پیر هریشت",
    },
  ],
  10: [
    {
      fr: "زیارت پیر هریشت",
    },
  ],
  11: [
    {
      fr: "زیارت پیر هریشت",
    },
  ],
  13: [
    {
      fr: "روز طبیعت",
      isHoliday: true,
    },
  ],
  19: [
    {
      fr: "جشن فروردین گان (فرودوگ)",
      isZHoliday: true,
    },
  ],
  33: [
    {
      fr: "جشن اردیبهشت گان",
    },
  ],
  41: [
    {
      fr: "چهره میدیوزرم گاه",
      type: "gahanbar",
    },
  ],
  42: [
    {
      fr: "چهره میدیوزرم گاه",
      type: "gahanbar",
    },
  ],
  43: [
    {
      fr: "چهره میدیوزرم گاه",
      type: "gahanbar",
    },
  ],
  44: [
    {
      fr: "چهره میدیوزرم گاه",
      type: "gahanbar",
    },
  ],
  45: [
    {
      fr: "چهره میدیوزرم گاه",
      type: "gahanbar",
    },
  ],
  66: [
    {
      fr: "جشن خوردادگان",
    },
  ],
  86: [
    {
      fr: "زیارت پیر سبز",
    },
  ],
  87: [
    {
      fr: "زیارت پیر سبز",
    },
  ],
  88: [
    {
      fr: "زیارت پیر سبز",
    },
  ],
  89: [
    {
      fr: "زیارت پیر سبز",
    },
  ],
  90: [
    {
      fr: "زیارت پیر سبز",
    },
  ],
  91: [
    {
      fr: "پرسه تیرماه",
    },
  ],
  95: [
    {
      fr: "زیارت پیر نارستانه",
    },
  ],
  96: [
    {
      fr: "زیارت پیر نارستانه",
    },
  ],
  97: [
    {
      fr: "زیارت پیر نارستانه",
    },
  ],
  98: [
    {
      fr: "زیارت پیر نارستانه",
    },
  ],
  99: [
    {
      fr: "زیارت پیر نارستانه",
    },
  ],
  101: [
    {
      fr: "چهره میدیوشهیمگاه",
      type: "gahanbar",
    },
  ],
  102: [
    {
      fr: "چهره میدیوشهیمگاه",
      type: "gahanbar",
    },
  ],
  103: [
    {
      fr: "چهره میدیوشهیمگاه",
      type: "gahanbar",
    },
    {
      fr: "جشن تیرگان",
    },
  ],
  104: [
    {
      fr: "چهره میدیوشهیمگاه",
      type: "gahanbar",
    },
  ],
  105: [
    {
      fr: "چهره میدیوشهیمگاه",
      type: "gahanbar",
    },
  ],
  106: [
    {
      fr: "زیارت پارس بانو",
    },
  ],
  107: [
    {
      fr: "زیارت پارس بانو",
    },
  ],
  108: [
    {
      fr: "زیارت پارس بانو",
    },
  ],
  109: [
    {
      fr: "زیارت پارس بانو",
    },
  ],
  110: [
    {
      fr: "زیارت پارس بانو",
    },
  ],
  127: [
    {
      fr: "جشن امردادگان",
    },
  ],
  136: [
    {
      fr: "زیارت پیرنارکی",
    },
  ],
  137: [
    {
      fr: "زیارت پیرنارکی",
    },
  ],
  138: [
    {
      fr: "زیارت پیرنارکی",
    },
  ],
  139: [
    {
      fr: "زیارت پیرنارکی",
    },
  ],
  140: [
    {
      fr: "زیارت پیرنارکی",
    },
  ],
  154: [
    {
      fr: "جشن شهریورگان",
    },
  ],
  176: [
    {
      fr: "چهره پیته شهیمگاه",
      type: "gahanbar",
    },
  ],
  177: [
    {
      fr: "چهره پیته شهیمگاه",
      type: "gahanbar",
    },
  ],
  178: [
    {
      fr: "چهره پیته شهیمگاه",
      type: "gahanbar",
    },
  ],
  179: [
    {
      fr: "چهره پیته شهیمگاه",
      type: "gahanbar",
    },
  ],
  180: [
    {
      fr: "چهره پیته شهیمگاه",
      type: "gahanbar",
    },
  ],
  196: [
    {
      fr: "جشن مهرگان",
      isZHoliday: true,
    },
  ],
  206: [
    {
      fr: "چهره ایاسرم  گاه",
      type: "gahanbar",
    },
  ],
  207: [
    {
      fr: "چهره ایاسرم  گاه",
      type: "gahanbar",
    },
  ],
  208: [
    {
      fr: "چهره ایاسرم  گاه",
      type: "gahanbar",
    },
  ],
  209: [
    {
      fr: "چهره ایاسرم  گاه",
      type: "gahanbar",
    },
  ],
  210: [
    {
      fr: "چهره ایاسرم  گاه",
      type: "gahanbar",
    },
  ],
  220: [
    {
      fr: "جشن آبانگان",
    },
  ],
  249: [
    {
      fr: "جشن آذرگان",
    },
  ],
  271: [
    {
      fr: "جشن دیگان",
    },
  ],
  278: [
    {
      fr: "جشن دیگان",
    },
  ],
  281: [
    {
      fr: "سالروز درگذشت اشوزرتشت",
      isZHoliday: true,
    },
  ],
  285: [
    {
      fr: "جشن دیگان",
    },
  ],
  286: [
    {
      fr: "چهره میدیاریم گاه",
    },
  ],
  287: [
    {
      fr: "چهره میدیاریم گاه",
    },
  ],
  288: [
    {
      fr: "چهره میدیاریم گاه",
    },
  ],
  289: [
    {
      fr: "چهره میدیاریم گاه",
    },
  ],
  290: [
    {
      fr: "چهره میدیاریم گاه",
    },
  ],
  293: [
    {
      fr: "جشن دیگان",
    },
  ],
  302: [
    {
      fr: "جشن بهمنگان",
    },
  ],
  316: [
    {
      fr: "جشن سده",
      isZHoliday: true,
    },
  ],
  331: [
    {
      fr: "پرسه اسفندماه",
    },
  ],
  335: [
    {
      fr: "جشن اسفندگان",
    },
  ],
};

export const ZMonthlyEvents = {
  8: [
    {
      fr: "زیارت پیر مراد",
    },
  ],
  15: [
    {
      fr: "زیارت پیر مهر ایزد",
    },
  ],
  19: [
    {
      fr: "زیارت شاورهرام ایزد",
    },
  ],
  25: [
    {
      fr: "زیارت ستی پیر",
    },
  ],
};
export const ZMonthlyHoliday = [0, 7, 14, 22];
export const ZDays = [
  { en: "urmazd", fr: "اورمزد" },
  { en: "vahman", fr: "وهمن" },
  { en: "ardibehesht", fr: "اردیبهشت" },
  { en: "shahrivar", fr: "شهریور" },
  { en: "spandarmaz", fr: "سپندارمذ" },
  { en: "khordad", fr: "خرداد" },
  { en: "amordad", fr: "امرداد" },
  { en: "dey be azar", fr: "دی به آذر" },
  { en: "azar", fr: "آذر" },
  { en: "aban", fr: "آبان" },
  { en: "khor(khir)", fr: "خور" },
  { en: "mah", fr: "ماه" },
  { en: "tir", fr: "تیر" },
  { en: "goosh", fr: "گوش" },
  { en: "dey be mehr", fr: "دی به مهر" },
  { en: "mehr", fr: "مهر" },
  { en: "soroush", fr: "سروش" },
  { en: "rashn", fr: "رشن" },
  { en: "farvardin", fr: "فروردین" },
  { en: "verahram", fr: "ورهرام" },
  { en: "ram", fr: "رام" },
  { en: "bad", fr: "یاد" },
  { en: "dey be din", fr: "دی بدین" },
  { en: "din", fr: "دین" },
  { en: "ard ", fr: "ارد" },
  { en: "ashtad", fr: "اشتاد" },
  { en: "asman", fr: "آسمان" },
  { en: "zamiyad", fr: "زامیاد" },
  { en: "mantraspand", fr: "مانتره سپند" },
  { en: "anaram", fr: "انارام" },
  { en: "ahnavad", fr: "اهنود" },
  { en: "oshtavad", fr: "اشتود" },
  { en: "sepantamad", fr: "سپنتمد" },
  { en: "vahookhashatr", fr: "وهوخشتر" },
  { en: "vahooshtoesh", fr: "وهشتواش" },
  { en: "avardad", fr: "اورداد" },
];
export const NaborsDay = [1, 11, 13, 20];
